In [1]:
import pandas as pd
import seaborn as sns

In [2]:
df = sns.load_dataset('titanic')

In [3]:
df

,survived,pclass,sex,age,sibsp,parch,fare,embarked,class,who,adult_male,deck,embark_town,alive,alone
0,0,3,male,22.0,1,0,7.2500,S,Third,man,True,NaN,Southampton,no,False
1,1,1,female,38.0,1,0,71.2833,C,First,woman,False,C,Cherbourg,yes,False
2,1,3,female,26.0,0,0,7.9250,S,Third,woman,False,NaN,Southampton,yes,True
3,1,1,female,35.0,1,0,53.1000,S,First,woman,False,C,Southampton,yes,False
4,0,3,male,35.0,0,0,8.0500,S,Third,man,True,NaN,Southampton,no,True
...,...,...,...,...,...,...,...,...,...,...,...,...,...,...,...
886,0,2,male,27.0,0,0,13.0000,S,Second,man,True,NaN,Southampton,no,True
887,1,1,female,19.0,0,0,30.0000,S,First,woman,False,B,Southampton,yes,True
888,0,3,female,NaN,1,2,23.4500,S,Third,woman,False,NaN,Southampton,no,False
889,1,1,male,26.0,0,0,30.0000,C,First,man,True,C,Cherbourg,yes,True
890,0,3,male,32.0,0,0,7.7500,Q,Third,man,True,NaN,Queenstown,no,True

In [7]:
female = 'female'
df.query('age>=25 and sex ==@female')

,survived,pclass,sex,age,sibsp,parch,fare,embarked,class,who,adult_male,deck,embark_town,alive,alone
1,1,1,female,38.0,1,0,71.2833,C,First,woman,False,C,Cherbourg,yes,False
2,1,3,female,26.0,0,0,7.9250,S,Third,woman,False,NaN,Southampton,yes,True
3,1,1,female,35.0,1,0,53.1000,S,First,woman,False,C,Southampton,yes,False
8,1,3,female,27.0,0,2,11.1333,S,Third,woman,False,NaN,Southampton,yes,False
11,1,1,female,58.0,0,0,26.5500,S,First,woman,False,C,Southampton,yes,True
...,...,...,...,...,...,...,...,...,...,...,...,...,...,...,...
871,1,1,female,47.0,1,1,52.5542,S,First,woman,False,D,Southampton,yes,False
874,1,2,female,28.0,1,0,24.0000,C,Second,woman,False,NaN,Cherbourg,yes,False
879,1,1,female,56.0,0,1,83.1583,C,First,woman,False,C,Cherbourg,yes,False
880,1,2,female,25.0,0,1,26.0000,S,Second,woman,False,NaN,Southampton,yes,False
885,0,3,female,39.0,0,5,29.1250,Q,Third,woman,False,NaN,Queenstown,no,False

In [8]:
df['age + 15'] = df['age'].apply(lambda age:age+15)

In [10]:
df['survived'] = df['survived'].map({0:'not survived',1:'survived'})

In [11]:
df

,survived,pclass,sex,age,sibsp,parch,fare,embarked,class,who,adult_male,deck,embark_town,alive,alone,age + 15
0,not survived,3,male,22.0,1,0,7.2500,S,Third,man,True,NaN,Southampton,no,False,37.0
1,survived,1,female,38.0,1,0,71.2833,C,First,woman,False,C,Cherbourg,yes,False,53.0
2,survived,3,female,26.0,0,0,7.9250,S,Third,woman,False,NaN,Southampton,yes,True,41.0
3,survived,1,female,35.0,1,0,53.1000,S,First,woman,False,C,Southampton,yes,False,50.0
4,not survived,3,male,35.0,0,0,8.0500,S,Third,man,True,NaN,Southampton,no,True,50.0
...,...,...,...,...,...,...,...,...,...,...,...,...,...,...,...,...
886,not survived,2,male,27.0,0,0,13.0000,S,Second,man,True,NaN,Southampton,no,True,42.0
887,survived,1,female,19.0,0,0,30.0000,S,First,woman,False,B,Southampton,yes,True,34.0
888,not survived,3,female,NaN,1,2,23.4500,S,Third,woman,False,NaN,Southampton,no,False,NaN
889,survived,1,male,26.0,0,0,30.0000,C,First,man,True,C,Cherbourg,yes,True,41.0
890,not survived,3,male,32.0,0,0,7.7500,Q,Third,man,True,NaN,Queenstown,no,True,47.0

In [13]:
data=pd.DataFrame({"A":[1,2,3],"B":[4,5,6],"C":[7,8,9]})

In [14]:
data

   A  B  C
0  1  4  7
1  2  5  8
2  3  6  9

In [15]:
data.columns

Index(['A', 'B', 'C'], dtype='object')

In [16]:
df_reordered = data[["C", "A", "B"]]

In [17]:
df_reordered

   C  A  B
0  7  1  4
1  8  2  5
2  9  3  6

In [18]:
df=pd.DataFrame({"country":["USA","USA","India","India"],"year":[2020,2021,2020,2021],"sales":[100,120,90,110],"profit":[20, 25, 18, 22] })

In [19]:
df

  country  year  sales  profit
0     USA  2020    100      20
1     USA  2021    120      25
2   India  2020     90      18
3   India  2021    110      22

In [20]:
melted = df.melt( id_vars=["country", "year"], # columnstokeep
                 value_vars=["sales","profit"],#columnstounpivot
                 var_name="metric", # new column name for variable 
                 value_name="value" # new column name for value (default is value) 
                 )

In [21]:
melted

  country  year  metric  value
0     USA  2020   sales    100
1     USA  2021   sales    120
2   India  2020   sales     90
3   India  2021   sales    110
4     USA  2020  profit     20
5     USA  2021  profit     25
6   India  2020  profit     18
7   India  2021  profit     22

In [23]:
df = sns.load_dataset('tips')
df

     total_bill   tip     sex smoker   day    time  size
0         16.99  1.01  Female     No   Sun  Dinner     2
1         10.34  1.66    Male     No   Sun  Dinner     3
2         21.01  3.50    Male     No   Sun  Dinner     3
3         23.68  3.31    Male     No   Sun  Dinner     2
4         24.59  3.61  Female     No   Sun  Dinner     4
..          ...   ...     ...    ...   ...     ...   ...
239       29.03  5.92    Male     No   Sat  Dinner     3
240       27.18  2.00  Female    Yes   Sat  Dinner     2
241       22.67  2.00    Male    Yes   Sat  Dinner     2
242       17.82  1.75    Male     No   Sat  Dinner     2
243       18.78  3.00  Female     No  Thur  Dinner     2

[244 rows x 7 columns]

In [24]:
melted_df = df.melt(
    id_vars = ['sex','smoker','day','time','size'],
    value_vars = ['total_bill','tip'],
    var_name='total_Bill_ammount',
    value_name='value'
    
)

In [25]:
melted_df

        sex smoker   day    time  size total_Bill_ammount  value
0    Female     No   Sun  Dinner     2         total_bill  16.99
1      Male     No   Sun  Dinner     3         total_bill  10.34
2      Male     No   Sun  Dinner     3         total_bill  21.01
3      Male     No   Sun  Dinner     2         total_bill  23.68
4    Female     No   Sun  Dinner     4         total_bill  24.59
..      ...    ...   ...     ...   ...                ...    ...
483    Male     No   Sat  Dinner     3                tip   5.92
484  Female    Yes   Sat  Dinner     2                tip   2.00
485    Male    Yes   Sat  Dinner     2                tip   2.00
486    Male     No   Sat  Dinner     2                tip   1.75
487  Female     No  Thur  Dinner     2                tip   3.00

[488 rows x 7 columns]

In [28]:
orignal = melted_df.pivot_table(
    index = ['sex','smoker','day','time','size'],
    columns = 'total_Bill_ammount',
    values = 'value',
    aggfunc='mean'  # or use another function as appropriate
)

C:\Users\Abid\AppData\Local\Temp\ipykernel_16432\1029911374.py:1: FutureWarning: The default value of observed=False is deprecated and will change to observed=True in a future version of pandas. Specify observed=False to silence this warning and retain the current behavior
  orignal = melted_df.pivot_table(

In [29]:
orignal

total_Bill_ammount                   tip  total_bill
sex    smoker day  time   size
Male   Yes    Thur Lunch  2     2.822500   19.058750
                          3     4.000000   18.710000
                          4     4.000000   20.530000
              Fri  Lunch  1     1.920000    8.580000
                          2     1.890000   12.790000
                   Dinner 2     2.875000   22.322500
                          4     4.730000   40.170000
              Sat  Dinner 2     2.318235   17.258235
                          3     4.602500   30.787500
                          4     3.384000   28.986000
                          5     3.000000   28.150000
              Sun  Dinner 2     3.314000   23.539000
                          3     3.750000   34.225000
                          4     5.090000   28.910000
                          5     2.000000   30.460000
       No     Thur Lunch  2     2.559375   15.263750
                          3     2.180000   22.820000
                          4     4.000000   27.200000
                          5     5.000000   41.190000
                          6     6.700000   34.300000
              Fri  Dinner 2     2.500000   17.475000
              Sat  Dinner 2     2.520588   14.787059
                          3     3.356667   21.524444
                          4     5.191667   32.105000
              Sun  Dinner 2     2.590000   15.887727
                          3     3.020000   22.291429
                          4     3.820000   25.242500
                          5     5.000000   20.690000
                          6     5.000000   48.170000
Female Yes    Thur Lunch  2     2.540000   14.990000
                          3     3.230000   16.470000
                          4     5.000000   43.110000
              Fri  Lunch  2     2.660000   13.260000
                   Dinner 2     2.700000   12.200000
              Sat  Dinner 1     1.000000    3.070000
                          2     2.721818   18.029091
                          3     4.500000   36.235000
                          4     3.090000   30.140000
              Sun  Dinner 2     3.500000   13.555000
                          3     3.500000   19.525000
       No     Thur Lunch  1     1.830000   10.070000
                          2     2.111667   13.172778
                          3     1.360000   18.640000
                          4     4.045000   29.455000
                          6     4.600000   28.425000
                   Dinner 2     3.000000   18.780000
              Fri  Lunch  3     3.000000   15.980000
                   Dinner 2     3.250000   22.750000
              Sat  Dinner 1     1.000000    7.250000
                          2     2.653750   18.660000
                          3     3.580000   23.276667
                          4     2.450000   20.690000
              Sun  Dinner 2     2.548000   14.562000
                          3     2.792500   17.305000
                          4     4.390000   29.915000
                          5     5.140000   29.850000